In [3]:
import numpy as np
import pandas as pd 
path = '../data/processed/'
categories = pd.read_csv(path + 'categories.csv')
areas = [pd.read_csv(path + 'area' + str(i) + '.csv') for i in range(1, 8)]

seed = 42
np.random.seed(seed)

In [15]:
def expected_profits(categories, area):
    profit = pd.DataFrame(columns=categories.columns, index=[0])
    number = pd.DataFrame(columns=categories.columns, index=[0])

    for column in categories.columns:
        number[column] = np.random.randint(0, categories[column][0])
        profit[column] = sum(area[column][:number[column][0]])

    return number, profit

In [22]:
number, profit = expected_profits(categories, areas[0])

In [23]:
number

   Child  Adult  Electric  Racing  Mountain  Tricycle
0    180     94        98     187       115       190

In [24]:
profit

       Child      Adult   Electric     Racing   Mountain  Tricycle
0  2883.8184  2443.4964  2526.9096  2419.5986  2828.5448  2819.265

In [27]:
areas[0][:98].sum()

Child       2487.1421
Adult       2573.4510
Electric    2526.9096
Racing      2253.5354
Mountain    2550.4895
Tricycle    2606.7449
dtype: float64

In [16]:
categories

   Child  Adult  Electric  Racing  Mountain  Tricycle
0    272  270.0     279.0   267.0     282.0       279
1      1    1.5       1.5     1.7       1.7         4

In [37]:
profit = pd.DataFrame()
number = pd.DataFrame()
for area in areas:
    n, p = expected_profits(categories, area)
    number = pd.concat([number, n], ignore_index=True)
    profit = pd.concat([profit, p], ignore_index=True)

number

   Child  Adult  Electric  Racing  Mountain  Tricycle
0     69    251       274     181       166        90
1    201     18        38     125       172       140
2    241    219       125      57       147         0
3    189    190       116     133        57        43
4    172    159       172     148        79       212
5    202    251       228     163       226       146
6     19     46       232      13       142         0

In [38]:
profit.style.highlight_max(color='lightblue', axis=0)